---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BoundingBoxIntersectsFilter..::..PassesFilter Method
BoundingBoxIntersectsFilter Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | PassesFilter(Element) | Applies the filter to a given element.  (Inherited from ElementFilter.) |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element.  (Inherited from ElementFilter.) |

# See Also

BoundingBoxIntersectsFilter Class

BoundingBoxIntersectsFilter Members

Autodesk.Revit.DB Namespace